# 1. Выбираем базовый образ.
#    Для Python проектов лучше использовать официальные образы.
#    -slim варианты меньше по размеру.
FROM python:3.10-slim-buster

# 2. Устанавливаем рабочую директорию внутри контейнера.
#    Все последующие команды будут выполняться относительно этой директории.
WORKDIR /app

# 3. Копируем файл зависимостей.
COPY requirements.txt .

# 4. Устанавливаем зависимости.
#    Используем --no-cache-dir для уменьшения размера образа.
#    Используем --upgrade pip для обеспечения актуальной версии установщика.
RUN pip install --no-cache-dir --upgrade pip && \
    pip install --no-cache-dir -r requirements.txt

# 5. Копируем весь остальной код проекта в рабочую директорию.
COPY . .

# 6. Определяем команду, которая будет выполняться по умолчанию при запуске контейнера.
#    Здесь мы запускаем pytest.
CMD ["pytest", "--alluredir=allure-results"]

